//Завдання №2
//Описати базовий клас «Рядок».
//Методи:
//1) конструктор без параметрів;
//2) конструктор, що приймає як параметр C - рядок(закінчується нульовим байтом);
//3) конструктор копіювання;
//4) оператор присвоєння;
//5) отримання довжини рядка;
//6) очищення рядка(зробити рядок порожнім);
//7) деструктор;
//8) конкатенація рядків(перевантажити оператори + і += );
//9) перевірка на рівність(== ) і на нерівність(!= ).
//Описати клас «Бітовий рядок» похідний від класу «Рядок»(Рядки цього класу можуть містити тільки символи
//	0 і 1).Якщо в основі рядка, який ініціалізує зустрінуться
//	будь - які символи, відмінні від допустимих, то «Бітовий
//	рядок» стає порожнім.Вміст рядка розглядається як
//	двійкове подання цілого числа зі знаковим розрядом.
//	Негативні числа зберігаються в додатковому коді.
//	Методи:
//1) конструктор без параметрів;
//2) конструктор, що приймає як параметр C - рядок;
//3) конструктор копіювання;
//4) оператор присвоєння;
//5) деструктор;
//6) зміна знаку числа(переклад числа в додатковий код).
//7) складання бітових рядків(перевантажити оператори
//+ і += );
//8) перевірка на рівність(== ) і на нерівність(!= ).


#pragma once
#include <iostream>
using namespace std;
#include "BinString.h"

int main()
{
	BinString MyBinStr;
	cout << MyBinStr.lenght()<<endl;
	char* str = new char[9] {"11001110"};
	char* str2 = new char[5] {"0010"};
	try
	{
		BinString MyBinStr2(str);
		BinString MyBinStr3(str2);
		cout << MyBinStr2.lenght()<<endl;
		MyBinStr2.show();
		MyBinStr3.show();
		BinString MyNewBin1 = MyBinStr2 + MyBinStr3;
		MyNewBin1.show();
		
	}
	catch (const IncorrectValueException& ex)
	{
		cout << "ERROR: " << ex.what() << endl;
	}
	delete[] str;
	delete[] str2;
	return 0;
}